Tekla Open API Reference for Tekla Structures 2025
UserDefinedElement Properties
The UserDefinedElement type exposes the following members.
Properties
Name | Description
Font
 The font of the user-defined attribute.
Name
 The name of the user-defined attribute.
Unit
 Gets or sets the unit attributes.
Value
 The value of the user-defined attribute.
Top
See Also
Reference
UserDefinedElement Class
Tekla.Structures.Drawing Namespace